{
  "architectures": [
    "NamerModel"
  ],
  "d_model": 128,
  "dim_feedforward": 512,
  "dropout": 0.0,
  "dtype": "float32",
  "eos_token_id": 40,
  "max_output_len": 20,
  "model_type": "custom",
  "nhead": 4,
  "num_encoder_layers": 4,
  "pad_token_id": 10,
  "transformers_version": "5.8.0",
  "vocab_size": 41
}
